# utils/config.py

TEXT_FIELDS = ["Эслатма", "Eslatma", "Проба", "Proba"]

MENU_DATA = {
    "Подоконник": {
        "stages": {
            "Миксер": {
                # Просто список -> Сразу матрица
                "items": ["ПВХ", "Мель", "Мельница", "Замес Сони", "Эслатма"]
            },
            "Цехдан": {
                # Группы + Качество -> Склеиваем и показываем Матрицу (там не так много)
                "groups": ["Ок 30", "Цветной 30", "Ок 50", "Цветной 50", "Ламбрид", "Гладкий 17"],
                "quality": ["Яхши", "Брак"]
            },
            "Резкага": {
                # Словарь групп -> Бот сделает КНОПКИ для ключей
                "groups": {
                    "Ок 50": ["20/20", "25/25", "30/20", "35/15", "40/10", "45/5"],
                    "Цветной 50": ["20/20", "25/25", "30/20", "35/15", "40/10", "45/5"],
                    "Размер Ок": ["25/20", "30/20", "30/25", "35/30", "35/25", "40/35", "40/30", "45/40", "45/35"],
                    "Размер Цветной": ["25/20", "30/20", "30/25", "35/30", "35/25", "40/35", "40/30", "45/40", "45/35"],
                    "Брак Ок": ["20", "25", "30", "35", "40", "45", "50"],
                    "Брак Цветной": ["20", "25", "30", "35", "40", "45", "50"]
                }
            },
            "Декор": {
                # Словарь групп -> КНОПКИ
                "groups": ["З/Д", "Мокко", "Серий", "Шефилд"],
                # Для Декора особая логика внутри: Размеры + Качество
                "sizes": ["20", "25", "30", "35", "40", "45"],
                "quality": ["Яхши", "Брак"]
            }
        }
    },
    "Резина": {
        "stages": {
            "Миксер": {
                "items": ["ПВХ", "Мель", "Доп", "Акрован", "Кислота", "Краска", "Замес сони", "Эслатма"]
            },
            "Цехдан": {
                "items": ["Ю", "Босма", "X", "5107", "5125", "2", "1", "Проба"]
            }
        }
    }
}

SHIFTS = ["День", "Ночь"]